{"posts":[{"title":"关于z3算法的探索","text":"这篇文章中，我们将讨论z3算法，以及它的实现原理。同时在python中引用z3库预测随机数的产生。想知道发生了什么？快点进来看看吧！ 先鸽着，明天写。","link":"/2024/12/12/z3-explore/"},{"title":"刮擦全息探讨：原理与计算","text":"最近B站首页推送了个叫刮擦全息的玩意，点进去一看，发现是用圆规在塑料板上刻划，通过光的反射形成的立体假象。一番搜索之后，发现其属于镜面全息图（Specular holography），早在 1990 年就由 William Beatty 提出。最终在搜寻古今中外大大小小看不懂写啥（英文是因为生词多，繁中是因为术语不同）的论文后，我终于摸清了原理。 提前叠个甲：本人现仍属于高中生，25年8月才会接触大学（物理）。若有纰漏欢迎指出。 （还在研究markdown的公式，预计明天写完）","link":"/2024/12/13/specular-holography/"},{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2024/12/11/hello-world/"}],"tags":[],"categories":[],"pages":[{"title":"关于","text":"One Last VIP为什么要用这个看上去不像正经网站的域名： 因为没钱，而 .vip 的续费价格最为便宜（Dynadot上），思来想去，决定买个字数少又简单好记的域名：1last.vip 格陵兰岛为什么说自己是格陵兰岛： 首先，每个人都是一座孤岛；其次，我既不是狭义上的Nerd，也不是狭义上的Geek。最后，每当病毒要传到/传出格陵兰岛时，格陵兰岛都会及时关闭唯一与外界相通的途径————港口（瘟疫公司梗），保护自己，或是成全大家。 A-Roll与B-Roll在Vlog拍摄中，A-Roll指含有主体人物的素材，而B-Roll指用以辅助的空镜。 如果说生活是A-Roll，那么爱好则是B-Roll。 同样，博客也可以分为A-log和B-log，你现在访问的网站，就是我的B-log。 我是一个热衷将现实与网络区分开来的人，在许多平台上有两个账号，分别处理现实与网络的事情。 在生活中，你很难将我与那个 玩MC的HR 联系起来，毕竟眼前这个沉默寡言的个体看上去怎么都不像是懂技术的。 或许有些人在网络上称呼我为”大佬”，但更多的，在现实里，我只是一个”局外人“。 有时我会想在网络账号上分享自己的生活，但随之而来的是对隐私泄露的担忧。因此，我从来没在视频中用过原声，也极少暴露我的身体部位（哪怕是手），像是被一种植根许久的PTSD，平尽所能保护着。 所以，在B-log中，我会尽量避免讨论生活。 历史与未来这个博客是19年/20年建立的，中途断断续续清过几次文章，换了几个域名，不时停站几个月，甚至用Unity3D重构过（模仿终端，因为“太酷啦”）。现在（2024/12/12）终于用回Hexo，博客也随着我高中毕业（不，准确来讲我现在还不是大一新生）而稳定存在。 记录过生活，也记录过技术。 很可惜的是，以前写的文章的源文件出于各种原因丢失。不过，从头写起也好。 我自己都4202年了，我还是有交流障碍。 有时苦恼于键盘下的文字冗长臃肿不够精简，会反复推敲用词，间接导致某些内容具有跳跃性；有时不知道如何与人沟通，会抓耳挠腮许久。更多的时候，障碍体现在 我辨别不清反语 + 我善于冷场 + 我说话含糊，这也是你很少再在交流群里看见我的身影的原因。 其实我懂的技术很少，主要集中于MC（想了解的可以去看我的B站主页）。用过一段时间Manjaro，会编程，一般需要啥学啥写啥，生活和游戏中遇到的问题不愁，试着用YOLO整过小的识别项目，写过五子棋AI，也做过桌面四足机器人、查词器等小玩意。没有接触过OI，但也在逐步学习算法。最喜欢的事情是研读大佬们的著作（然后发现自己是个菜鸡）。 悲哀的是，许多知识随着高中学业的日益繁忙被遗忘了。幸运的是，现在的我比当时啥都不懂滚爬摸打的我有了更开阔的眼界，和更充裕的时间。 这些年接触到了不少高校的大佬，羞愧于自身技术力不足之外更多的是敬佩。好在时候也不晚，路漫漫其修远兮，吾将上下而求索。希望未来的我能再一次让过去的我刮目相看（上一次是研究更新抑制）。 我经历过各种方面的低谷，学业，心理，甚至恋爱。被击垮过，陷入迷茫过。如果有什么我想在B-log分享的A-log相关的事情，那就是做好当下。听上去很鸡汤，但很多事情无旁门左道（当然你要能找到个稳妥的最好，就像某些MC跑酷地图可以卡出去跳关）只能依靠自己。 游戏方面，我主要玩Minecraft。FPS游戏有守望先锋，漫威争锋。3A方面有赛博朋克2077，死亡搁浅（DeathStranding），GTA系列。同时玩一些独立游戏和metagame（如六角疑云(The Hex)，小马岛，邪恶冥刻等Daniel的作品），目前最大的心愿是给几款游戏补票。 会飞无人机，会用Lightroom修图，有时候会想当个航拍UP主（ 联系方式鉴于之前发生过GitHub上有人发现我魔改的插件加了点他们没能实现的功能（网易云discord听歌状态插件，我顺手加了个读取网易云缓存文件获取当前歌曲专辑封面的功能等），提merge request结果一年后我上GitHub才回复的离谱事件， 有急事请联系我的邮箱，支持中文/English。邮箱自己转码下就知道了，写成这样单纯是防爬虫：坏router艾特狐狸邮件点com 你知道吗？ · 左侧的Follow.it邮箱订阅是可以用的，订阅后有文章更新你就会收到邮件。 · 理论来讲，左侧的Google Ads能正常运作","link":"/about/index.html"},{"title":"友链申请","text":"如果您也有自己的个人博客，且愿意互换友链，可先在贵站添加我的站点，再在下方留言。 审核之后，贵站的信息会被放在左侧。 不出意外，本博客这次会一直运营下去，直到宇宙热寂。 因为自己的小癖好，加了些单向友链。 单向友链如下： 名称 详情 Matrix67’s Blog 与数学有关的个人博客，从约06年记载至今 本站信息： 名称：HackerRouter’s Blog 描述：在Nerd与Geek间选择了当格陵兰岛。 链接：http://1last.vip/ 头像链接：http://1last.vip/img/avatar.png 友链申请格式 名称： 链接： 一部分友链现因无法访问被移除，若你发现自己友链没了，请在评论区留言 欢迎交换友链~","link":"/application/index.html"}]}